In [29]:
import pandas as pd

In [30]:
data  = [10, 20, 30, 45, 30]
index = ['Arthur', 'Riquelme', 'Thalys', 'Thiago', 'Tieres']
df = pd.DataFrame(pd.Series(data = data, index = index))

In [31]:
df

           0
Arthur    10
Riquelme  20
Thalys    30
Thiago    45
Tieres    30

In [32]:
new_data = ['A', 'B', 'C', 'D', 'E']
df['new_col'] = new_data

In [33]:
df

           0 new_col
Arthur    10       A
Riquelme  20       B
Thalys    30       C
Thiago    45       D
Tieres    30       E

In [34]:
import pandas as pd

# Criar um DataFrame de exemplo
data = {'A': [1, 2, 3],
        'B': [4, 5, 6]}
df = pd.DataFrame(data)

# Adicionar uma nova coluna 'C'
new_column_data = [7, 8, 9]  # Dados para a nova coluna
df['C'] = new_column_data

print(df)

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9